export interface Question {
  id: number;
  category: string;
  points: number;
  question: string;
  answer: string;
  author: string;
}

export const categories = [
  'Новогодние факты',
  'Мекеним ❤',
  'Личности 👤',
  '🤔 Верю / Не верю',
  'Мой город (Бишкек)',
];

export const pointValues = [100, 200, 300, 400, 500, 600];

export const questions: Question[] = [
  {
    id: 1,
    category: 'Личности 👤',
    points: 100,
    question: 'Художник, написавший «Мону Лизу»',
    answer: 'Леонардо да Винчи',
    author: 'Comtehno',
  },
  {
    id: 2,
    category: 'Личности 👤',
    points: 200,
    question: 'Полководец, не проигравший ни одного сражения?',
    answer: 'Александр Македонский',
    author: 'Comtehno',
  },
  {
    id: 3,
    category: 'Личности 👤',
    points: 300,
    question: 'Первый президент США ',
    answer: 'Джордж Вашингтон',
    author: 'Comtehno',
  },
  {
    id: 4,
    category: 'Личности 👤',
    points: 400,
    question: 'Древнегреческий математик, открывший закон рычага',
    answer: 'Архимед',
    author: 'Comtehno',
  },
  {
    id: 5,
    category: 'Личности 👤',
    points: 500,
    question: 'Художник, отрезавший себе ухо',
    answer: 'Винсент Ван Гог',
    author: 'Comtehno',
  },
  {
    id: 6,
    category: 'Личности 👤',
    points: 600,
    question: 'Персидский поэт и философ, автор рубаи',
    answer: 'Омар Хайям',
    author: 'Comtehno',
  },
  {
    id: 7,
    category: 'Новогодние факты',
    points: 100,
    question:
      'В какой деревне жили кот Матроскин и пес Шарик, праздновавшие Новый год с самоваром?',
    answer: 'Простоквашино',
    author: 'Comtehno',
  },
  {
    id: 8,
    category: 'Новогодние факты',
    points: 200,
    question: 'Где появилась традиция запускать фейерверки?',
    answer: 'В Китае',
    author: 'Comtehno',
  },
  {
    id: 9,
    category: 'Новогодние факты',
    points: 300,
    question:
      'Этот атрибут праздника был изобретен в Англии кондитером: он хотел сделать сюрприз внутри конфеты, который открывался бы с громким звуком. ',
    answer: 'Хлопушка',
    author: 'Comtehno',
  },
  {
    id: 10,
    category: 'Новогодние факты',
    points: 400,
    question:
      'В какой стране вместо ёлки на Новый год принято украшать бамбук или карликовые сосны?',
    answer: 'Япония',
    author: 'Comtehno',
  },
  {
    id: 11,
    category: 'Новогодние факты',
    points: 500,
    question:
      'Какая страна считается родиной традиции наряжать ёлку? (подсказываем: в Европе)',
    answer: 'Германия',
    author: 'Comtehno',
  },
  {
    id: 12,
    category: 'Новогодние факты',
    points: 600,
    question:
      'Какое новогоднее обещание студенты дают каждый год, но никогда не выполняют?',
    answer:
      'Начать делать домашние задания вовремя и не откладывать на последний день, Буду хорошо учиться',
    author: 'Comtehno',
  },
  {
    id: 13,
    category: '❄️ Цифровая Зима',
    points: 100,
    question: 'Какой самый популярный новогодний эмодзи?',
    answer: '🎄 (ёлка) или 🎅 (Дед Мороз)',
    author: 'Comtehno',
  },
  {
    id: 14,
    category: '❄️ Цифровая Зима',
    points: 200,
    question: 'Как называется популярный зимний фильтр в Instagram?',
    answer: 'Снежинки или Winter Wonderland',
    author: 'Comtehno',
  },
  {
    id: 15,
    category: '❄️ Цифровая Зима',
    points: 300,
    question:
      'Какая игра становится самой популярной в новогодние каникулы среди студентов?',
    answer:
      'Любая игра - у них наконец-то есть время! (или конкретно: Dota 2, CS, Among Us)',
    author: 'Comtehno',
  },
  {
    id: 16,
    category: '❄️ Цифровая Зима',
    points: 400,
    question: 'Какой новогодний мем про программистов стал вирусным в 2024?',
    answer:
      "Любой мем про дедлайны 31 декабря или 'Deploy на продакшн перед Новым годом'",
    author: 'Comtehno',
  },
  {
    id: 17,
    category: '❄️ Цифровая Зима',
    points: 500,
    question:
      'Как называется челлендж, где люди публикуют фото себя в новогодних свитерах?',
    answer: 'Ugly Christmas Sweater Challenge',
    author: 'Comtehno',
  },
  {
    id: 18,
    category: '❄️ Цифровая Зима',
    points: 600,
    question:
      'Какая соцсеть первой добавила новогодние AR-маски со снегом и оленями?',
    answer: 'Snapchat',
    author: 'Comtehno',
  },
  {
    id: 22,
    category: 'Мой город (Бишкек)',
    points: 100,
    question:
      'От какого предмета кыргызской утвари, возможно, произошло название города Бишкек?',
    answer: 'Палка для перемешивания  кымыза',
    author: 'Comtehno',
  },
  {
    id: 19,
    category: 'Мой город (Бишкек)',
    points: 200,
    question: 'Какая самая длинная улица в Бишкеке?',
    answer: 'Абдрахманова-Байтик Баатыра (Советская)',
    author: 'Comtehno',
  },
  {
    id: 20,
    category: 'Мой город (Бишкек)',
    points: 300,
    question: 'Как называется первый парк, заложенный в Бишкеке?',
    answer: 'Дубовый парк',
    author: 'Comtehno',
  },
  {
    id: 21,
    category: 'Мой город (Бишкек)',
    points: 400,
    question:
      'Когда был построен первый панорамный кинотеатр в Бишкеке? (1945,1937,1963)',
    answer: ' 1963 год',
    author: 'Comtehno',
  },
  {
    id: 23,
    category: 'Мой город (Бишкек)',
    points: 500,
    question: 'Почему Ошский базар получил своё название?',
    answer: 'Базар был построен рабочими из Оша',
    author: 'Comtehno',
  },
  {
    id: 24,
    category: 'Мой город (Бишкек)',
    points: 600,
    question: 'В каком году был основан город Бишкек? (1825, 1878, 1901)',
    answer: '1825',
    author: 'Comtehno',
  },
  {
    id: 25,
    category: '☃️ Fun & Party Time',
    points: 100,
    question:
      'Задание для команды: назовите 5 новогодних фильмов за 30 секунд!',
    answer: 'Любые 5 фильмов (Один дома, Ирония судьбы, Эльф, Гринч и т.д.)',
    author: 'Comtehno',
  },
  {
    id: 26,
    category: '☃️ Fun & Party Time',
    points: 200,
    question: 'Спойте первые 2 строчки любой новогодней песни всей командой!',
    answer:
      'Любая новогодняя песня (В лесу родилась ёлочка, Jingle Bells и т.д.)',
    author: 'Comtehno',
  },
  {
    id: 27,
    category: '☃️ Fun & Party Time',
    points: 300,
    question: "Изобразите пантомимой: 'Дед Мороз застрял в трубе'",
    answer: 'Оценивается ведущим и зрителями',
    author: 'Comtehno',
  },
  {
    id: 28,
    category: '☃️ Fun & Party Time',
    points: 400,
    question:
      'Командная задача: постройте живую ёлку из участников команды за 1 минуту!',
    answer: 'Оценивается креативность и скорость',
    author: 'Comtehno',
  },
  {
    id: 29,
    category: '☃️ Fun & Party Time',
    points: 500,
    question: 'Придумайте рэп про Новый год и университет (минимум 4 строки)!',
    answer: 'Оценивается креативность и рифма',
    author: 'Comtehno',
  },
  {
    id: 30,
    category: '☃️ Fun & Party Time',
    points: 600,
    question:
      'Финальный вызов: вся команда должна станцевать танец снежинок 30 секунд!',
    answer: 'Оценивается синхронность и веселье',
    author: 'Comtehno',
  },
  {
    id: 31,
    category: '🤔 Верю / Не верю',
    points: 100,
    question:
      'Верите ли вы, что в Италии в новогоднюю ночь принято выбрасывать старую мебель прямо из окон?',
    answer: 'Да (верю)',
    author: 'Comtehno',
  },
  {
    id: 32,
    category: '🤔 Верю / Не верю',
    points: 200,
    question:
      'Верите ли вы, что в Австралии Дед Мороз появляется не на санях, а на доске для серфинга и в плавках?',
    answer: 'Да (верю)',
    author: 'Comtehno',
  },
  {
    id: 33,
    category: '🤔 Верю / Не верю',
    points: 300,
    question:
      'Верите ли вы, что в Греции хозяин дома в полночь разбивает об стену гранат «на счастье»?',
    answer: 'Да (верю)',
    author: 'Comtehno',
  },
  {
    id: 34,
    category: '🤔 Верю / Не верю',
    points: 400,
    question:
      'Верите ли вы, что в Индии вместо ёлки на Новый год украшают пальму бананами?',
    answer: 'Да (верю)',
    author: 'Comtehno',
  },
  {
    id: 35,
    category: '🤔 Верю / Не верю',
    points: 500,
    question:
      'Верите ли вы, что в Японии в новогоднюю ночь принято съедать 12 виноградин под бой часов?',
    answer: 'Нет (это традиция Испании)',
    author: 'Comtehno',
  },
  {
    id: 36,
    category: '🤔 Верю / Не верю',
    points: 600,
    question:
      'Верите ли вы, что в Аргентине в последний рабочий день года из окон офисов выбрасывают старые ненужные бумаги?',
    answer: 'Да (верю)',
    author: 'Comtehno',
  },
  {
    id: 37,
    category: 'Мекеним ❤',
    points: 100,
    question:
      'Какое озеро в Кыргызстане никогда не замерзает и считается жемчужиной страны?',
    answer: 'Ысык-Кол',
    author: 'Comtehno',
  },
  {
    id: 38,
    category: 'Мекеним ❤',
    points: 200,
    question: 'Сколько городов в Кыргызстане ',
    answer: '31 город',
    author: 'Comtehno',
  },
  {
    id: 39,
    category: 'Мекеним ❤',
    points: 300,
    question: 'Назовите авторов гимна Кыргызстана.',
    answer: `Автор слов	Ж. Садыков,
Ш. Кулуев, 1992 год
Композитор	Н. Давлесов,
К. Молдобасанов, 1992 год`,
    author: 'Comtehno',
  },
  {
    id: 40,
    category: 'Мекеним ❤',
    points: 400,
    question:
      'Как называется самый высокий пик Кыргызстана и сколько метров над уровнем моря?',
    answer: 'Пик Победы (7439 м)',
    author: 'Comtehno',
  },
  {
    id: 41,
    category: 'Мекеним ❤',
    points: 500,
    question: 'В какой области Кыргызстана находится пик Ленина?',
    answer: 'Ошская область',
    author: 'Comtehno',
  },
  {
    id: 42,
    category: 'Мекеним ❤',
    points: 600,
    question: 'Назовите отцов оснавателей Кыргызстана.',
    answer:
      ' Иманалы Айдарбеков, Жусуп Абдрахманов, Касым Тыныстанов, Торекул Айтматов, Ишеналы Арабаева,Абдыкерим Сыдыков,Баялы Исакеев,Абдыкадыр Орозбеков',
    author: 'Comtehno',
  },
];
